#### Terraform Initialization ⚙️ `success`

#### Terraform Validation ✅ `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

data.cloudflare_zone.zone: Reading...
data.cloudflare_zone.zone: Read complete after 0s [id=2cfd579b89369f6a8e7f2d6f55c1dfca]
cloudflare_record.google: Refreshing state... [id=6752099686cc4ba30a0c6ab61efc57d5]
cloudflare_page_rule.redirect_www: Refreshing state... [id=00254793b35e22df3644f68114883f44]
cloudflare_record.openpgpkey: Refreshing state... [id=9d39803fea1161900eadb3ec265d56f6]
cloudflare_record.production_ipv6: Refreshing state... [id=6e15ba5c162a9aaf0b0169b4742dd564]
cloudflare_record.production_www_ipv6: Refreshing state... [id=097b10faaf70d2dd40099ae8f1ce0b6f]
cloudflare_record.next_ipv6: Refreshing state... [id=9c3b3926aef1e73291ba9c363e79c108]
cloudflare_record.spf: Refreshing state... [id=f45826d2d351bb30c98bc916a6c1a8d0]
cloudflare_record.mail: Refreshing state... [id=0a7cf42fee140ef2c515f7e244b79b62]
cloudflare_record.production_www_ipv4: Refreshing state... [id=f7d23497a2fe25a4152ca4d0b4773a34]
cloudflare_record.mail_lockdown: Refreshing state... [id=a0d4e7bfade553ccfef588b010ba823f]
cloudflare_list.redirect_pages: Refreshing state... [id=00e5156ca23448baaa3c8955c362f5b7]
cloudflare_record.production_ipv4: Refreshing state... [id=f6da7cf81e26104ddcc6c4d5d445a8c9]
cloudflare_record.bimi: Refreshing state... [id=343168ec6ec621d98d7f3c21812f9ffb]
cloudflare_record.have_i_been_pwned: Refreshing state... [id=fd40066a24b3b54b37c2e846f929e761]
cloudflare_record.dmarc: Refreshing state... [id=a1a8eac1293bae6f6d1aa2462c85fd6a]
cloudflare_zone_settings_override.zone_settings: Refreshing state... [id=2cfd579b89369f6a8e7f2d6f55c1dfca]
cloudflare_record.next_ipv4: Refreshing state... [id=4c7264671b72dccd05af23471ba88f43]
cloudflare_record.dkim: Refreshing state... [id=c318f9e1465c4f33e52cbb14713311e5]
cloudflare_ruleset.redirect_pages: Refreshing state... [id=ea40e7fbf0244cf48671430bd6a633c3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_list.redirect_pages will be updated in-place
  ~ resource "cloudflare_list" "redirect_pages" {
        id          = "00e5156ca23448baaa3c8955c362f5b7"
        name        = "pascaliske_dev_redirects"
        # (3 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # cloudflare_page_rule.redirect_www will be updated in-place
  ~ resource "cloudflare_page_rule" "redirect_www" {
        id       = "00254793b35e22df3644f68114883f44"
      ~ target   = "www.pascaliske.dev/*" -> "www.pascaliske.dev*"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # cloudflare_record.bluesky will be created
  + resource "cloudflare_record" "bluesky" {
      + allow_overwrite = false
      + content         = "did=did:plc:ydh7eh65yxeaewinqv7wcno4"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_atproto"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

</details>

*Pushed by: @pascaliske, Action: `pull_request`, Workflow: `Terraform`*